using System;
using System.Collections.ObjectModel;
using Project_TA.FoodPage;
using Project_TA.Models;

namespace Project_TA.Services
{
    public class GenerateFood
    {
        public ObservableCollection<Recipes> Recipes { get; set; }

        

        public void Generate()
        {
            Recipes = new ObservableCollection<Recipes>();
            Recipes.Add(new Recipes
            {
                Ingredient = "1.เนื้อวัวหั่นเต๋า 1 กิโลกรัม" +
                "2.ข่าแก่หั่นแว่น 4 แว่น" +
                "3.เก๋ากี้ 2 ช้อนโต๊ะ" +
                "4.อบเชย 2 แท่ง" +
                "5.โป๊ยกั๊ก 3 ดอก" +
                "6.ซีอิ๊วขาว 2 ช้อนโต๊ะ" +
                "7.ซอสหอยนางรม 2 ช้อนโต๊ะ" +
                "8.เกลือ 1 ช้อนชา" +
                "9.น้ำตาลปี๊บ 1 ช้อนโต๊ะ" +
                "10.พริกตำ 1 ช้อนโต๊ะ" +
                "11.มะนาว 2 ลูก" +
                "12.หอมหัวใหญ่ ครึ่ง ลูก" +
                "13.มะเขือเทศ 1 ลูก" +
                "14.ขึ้นฉ่าย สำหรับโรย หอมเจียว สำหรับโรย",
                FoodName = "ซุปเนื้ออิสลาม",
                FoodImage = "soup01.png",
                FoodRecipes = "STEP1\nตั้งหม้อใส่น้ำ ตั้งไฟจนเริ่มเดือด ใส่เนื้อวัวหั่นเต๋าลงไป อบเชย โป๊ยกั๊ก เก๋ากี๊ และข่า ลงไปตุ๋น ปรุงรสด้วย เกลือ ซีอิ๊วขาว ซอสหอยนางรม และน้ำตาลปี๊บ\n" +
                "ตุ๋นไฟอ่อนไว้ เป็นเวลา 1 ชั่วโมง จากนั้นใส่หอมหัวใหญ่ มะเขือเทศ ตุ๋นต่ออีก 30 นาที\nตั้งไฟจนเริ่มเดือด ใส่เนื้อวัวหั่นเต๋าลงไป\n" +
                "ใส่เครื่องตุ๋น" +
                "ปรุงรสด้วย เกลือ ซีอิ๊วขาว ซอสหอยนางรม และน้ำตาลปี๊บ" +
                "ใส่หอมหัวใหญ่ มะเขือเทศ ตุ๋นต่ออีก 30 นาที" +
                "STEP2\nใส่พริกขี้หนู และบีบมะนาวลงในชามที่จะใช้เสิร์ฟ ตักซุปเนื้อที่ตุ๋นไว้ลงไป คนเล็กน้อยให้รสชาติเข้ากัน" +
                "โรยหน้าด้วย หอมเจียว และขึ้นฉ่าย" +
                "ใส่พริกขี้หนู และบีบมะนาวลงในชามที่จะใช้เสิร์ฟ"
                
            });
            Recipes.Add(new Recipes
            {
                Ingredient = "ปีกไก่บน 8-10 ชิ้น\n" +
                "มันฝรั่งหั่นท่อน 2 ลูก\n" +
                "แครอทหั่นท่อน 1 หัว\n" +
                "มะเขือเทศหั่นสี่ส่วน 2 ลูก\n" +
                "หอมใหญ่หั่นสี่ส่วน 1 ลูกใหญ่\n" +
                "ผักชี ตามชอบ\n" +
                "เกลือป่น 2 ช้อนชา\n" +
                "น้ำปลา 2 ช้อนโต๊ะ\n" +
                "พริกไทยป่น ตามชอบ",
                FoodName = "ซุปไก่มันฝรั่ง",
                FoodImage = "soup02.png",
                FoodRecipes ="เตรียมวัตถุดิบให้พร้อม นำไก่ไปต้มในน้ำเดือดก่อน 1 รอบแล้วตักขึ้นพักไว้ " +
                "ใส่น้ำประมาณครึ่งหม้อ พอน้ำเดือด ใส่เกลือ+ไก่ที่ต้มแล้วลงไป ตามด้วยแครอท+มันฝรั่ง " +
                "เปิดไฟอ่อนตุ๋นทิ้งไว้ประมาณ 30 นาที (คอยตักฟองออก) จนผักสุกนิ่มดี " +
                "ปรุงรสด้วยน้ำปลาและพริกไทย แล้วใส่มะเขือเทศ+หอมใหญ่ ต้มทิ้งไว้อีก 5-10 นาที แล้วปิดเตา"
            });
            Recipes.Add(new Recipes
            {
                Ingredient = "บะหมี่เหลือง 2 ก้อน น้ำมันสำหรับทอด 2 ถ้วยตวง กระเทียมสับ 1 ช้อนโต๊ะ\n" +
                "ยอดคะน้า 1ส่วน4 ถ้วยตวง น้ำตาลทราย ครึ่ง ช้อนโต๊ะ ซีอิ๊วขาว 1 ช้อนโต๊ะ\n" +
                "ซีอิ๊วดำ ครึ่ง ช้อนโต๊ะ ไข่ไก่ 1 ฟอง น้ำมันพืช สำหรับผัด\n" +
                "วิธีหมักหมู\n" +
                "เนื้อหมูส่วนสะโพก 100 กรัม น้ำมันหอย 1 ช้อนโต๊ะ ซีอิ๊วขาว 1 ช้อนโต๊ะ\n" +
                "แป้งมันสำปะหลัง 1 ช้อนโต๊ะ น้ำมันพืช 1 ช้อนโต๊ะ",
                FoodName = "หมี่กรอบผัดซีอิ๊ว",
                FoodImage = "noodle01.png",
                FoodRecipes = "คลี่บะหมี่เหลืองออก ตีแป้งออกและไม่ให้ติดกันเป็นก้อน พอน้ำมันร้อน" +
                "ใส่ลงไปทอดทีนะน้อย ทอดให้สุกทั้งสองด้าน รีบตักขึ้นพักไว้ให้สะเด็ดน้ำมัน\n" +
                "ตั้งกระทะสำหรับผัด ใช้ไฟกลาง ใส่น้ำมันพืชสำหรับผัดลงไป เมื่อน้ำมันพอร้อน ใส่กระเทียมลงไปผัดให้พอหอม " +
                "ใส่หมูที่หมักไว้ลงไป ผัดให้พอสุกแล้วใส่ไข่ลงไป ผัดจนไข่สุก\n" +
                "ใส่ยอดคะน้าตามลงไป ปรุงรสด้วยซีอิ๊วขาว น้ำตาลทราย และซีอิ๊วดำ ผัดให้เข้ากัน\n" +
                "สุดท้ายใส่บะหมี่เหลืองที่ทอดไว้ลงไป คลุกให้เครื่องปรุงเคลือบเส้น ยกขึ้นพร้อมจัดเสิร์ฟ"
            });
        }
    }
}
